openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103.h
/* LPTIM Registers */
typedef struct
{
    __IO uint32_t ISR;
    __IO uint32_t ICR;
    __IO uint32_t IER;
    __IO uint32_t CFGR;
    __IO uint32_t CR;
    __IO uint16_t CMP;
    uint16_t      RESERVED0;
    __IO uint16_t ARR;
    uint16_t      RESERVED1;
    __IO uint16_t CNT;
    uint16_t      RESERVED2;
} LPTIM_TypeDef;

/* PD Registers */
typedef struct
{
    union
    {
        __IO uint32_t USBPD_CONFIG;
        struct
        {
            __IO uint16_t CONFIG;
            __IO uint16_t BMC_CLK_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_CONTROL;
        struct
        {
            union
            {
                __IO uint16_t R16_CONTROL;
                struct
                {
                    __IO uint8_t  CONTROL;
                    __IO uint8_t  TX_SEL;
                };
            };
            __IO uint16_t BMC_TX_SZ;
        };
    };
    union
    {
        __IO uint32_t USBPD_STATUS;
        struct
        {
            union
            {
                __IO uint16_t R16_STATUS;
                struct
                {
                    __IO uint8_t  DATA_BUF;
                    __IO uint8_t  STATUS;
                };
            };
            __IO uint16_t BMC_BYTE_CNT;
        };
    };
    union
    {
        __IO uint32_t USBPD_PORT;
        struct
        {
            __IO uint16_t PORT_CC1;
            __IO uint16_t PORT_CC2;
        };
    };
    union
    {
        __IO uint32_t USBPD_DMA;
        struct
        {
            __IO uint16_t DMA;
            __IO uint16_t RESERVED;
        };
    };
} USBPD_TypeDef;

/* USBFS Registers */
typedef struct
{
    __IO uint8_t  BASE_CTRL;
    __IO uint8_t  UDEV_CTRL;
    __IO uint8_t  INT_EN;
    __IO uint8_t  DEV_ADDR;
    __IO uint8_t  Reserve0;
    __IO uint8_t  MIS_ST;
    __IO uint8_t  INT_FG;
    __IO uint8_t  INT_ST;
    __IO uint32_t RX_LEN;
    __IO uint8_t  UEP4_1_MOD;
    __IO uint8_t  UEP2_3_MOD;
    __IO uint8_t  UEP5_6_MOD;
    __IO uint8_t  UEP7_MOD;
    __IO uint32_t UEP0_DMA;
    __IO uint32_t UEP1_DMA;
    __IO uint32_t UEP2_DMA;
    __IO uint32_t UEP3_DMA;
    __IO uint32_t UEP4_DMA;
    __IO uint32_t UEP5_DMA;
    __IO uint32_t UEP6_DMA;
    __IO uint32_t UEP7_DMA;
    __IO uint16_t UEP0_TX_LEN;
    union{
        __IO uint16_t  UEP0_CTRL;
        struct{
            __IO uint8_t  UEP0_TX_CTRL;
            __IO uint8_t  UEP0_RX_CTRL;
        };
    };
    __IO uint16_t UEP1_TX_LEN;
    union{
        __IO uint16_t  UEP1_CTRL;
        struct{
            __IO uint8_t  UEP1_TX_CTRL;
            __IO uint8_t  UEP1_RX_CTRL;
        };
    };
    __IO uint16_t UEP2_TX_LEN;
    union{
        __IO uint16_t  UEP2_CTRL;
        struct{
            __IO uint8_t  UEP2_TX_CTRL;
            __IO uint8_t  UEP2_RX_CTRL;
        };
    };
    __IO uint16_t UEP3_TX_LEN;
    union{
        __IO uint16_t  UEP3_CTRL;
        struct{
            __IO uint8_t  UEP3_TX_CTRL;
            __IO uint8_t  UEP3_RX_CTRL;
        };
    };
    __IO uint16_t UEP4_TX_LEN;
    union{
        __IO uint16_t  UEP4_CTRL;
        struct{
            __IO uint8_t  UEP4_TX_CTRL;
            __IO uint8_t  UEP4_RX_CTRL;
        };
    };
    __IO uint16_t UEP5_TX_LEN;
    union{
        __IO uint16_t  UEP5_CTRL;
        struct{
            __IO uint8_t  UEP5_TX_CTRL;
            __IO uint8_t  UEP5_RX_CTRL;
        };
    };
    __IO uint16_t UEP6_TX_LEN;
    union{
        __IO uint16_t  UEP6_CTRL;
        struct{
            __IO uint8_t  UEP6_TX_CTRL;
            __IO uint8_t  UEP6_RX_CTRL;
        };
    };
    __IO uint16_t UEP7_TX_LEN;
    union{
        __IO uint16_t  UEP7_CTRL;
        struct{
            __IO uint8_t  UEP7_TX_CTRL;
            __IO uint8_t  UEP7_RX_CTRL;
        };
    };
    __IO uint32_t Reserve1;
    __IO uint32_t OTG_CR;
    __IO uint32_t OTG_SR;
} USBFSD_TypeDef;

typedef struct
{
    __IO uint8_t   BASE_CTRL;
    __IO uint8_t   HOST_CTRL;
    __IO uint8_t   INT_EN;
    __IO uint8_t   DEV_ADDR;
    __IO uint8_t   Reserve0;
    __IO uint8_t   MIS_ST;
    __IO uint8_t   INT_FG;
    __IO uint8_t   INT_ST;
    __IO uint16_t  RX_LEN;
    __IO uint16_t  Reserve1;
    __IO uint8_t   Reserve2;
    __IO uint8_t   HOST_EP_MOD;
    __IO uint16_t  Reserve3;
    __IO uint32_t  Reserve4;
    __IO uint32_t  Reserve5;
    __IO uint32_t  HOST_RX_DMA;
    __IO uint32_t  HOST_TX_DMA;
    __IO uint32_t  Reserve6;
    __IO uint32_t  Reserve7;
    __IO uint32_t  Reserve8;
    __IO uint32_t  Reserve9;
    __IO uint32_t  Reserve10;
    __IO uint16_t  Reserve11;
    __IO uint16_t  HOST_SETUP;
    __IO uint8_t   HOST_EP_PID;
    __IO uint8_t   Reserve12;
    __IO uint8_t   Reserve13;
    __IO uint8_t   HOST_RX_CTRL;
    __IO uint16_t  HOST_TX_LEN;
    __IO uint8_t   HOST_TX_CTRL;
    __IO uint8_t   Reserve14;
    __IO uint32_t  Reserve15;
    __IO uint32_t  Reserve16;
    __IO uint32_t  Reserve17;
    __IO uint32_t  Reserve18;
    __IO uint32_t  Reserve19;
    __IO uint32_t  OTG_CR;
    __IO uint32_t  OTG_SR;
} USBFSH_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define PB1PERIPH_BASE                         (PERIPH_BASE)
#define PB2PERIPH_BASE                         (PERIPH_BASE + 0x10000)
#define HBPERIPH_BASE                          (PERIPH_BASE + 0x20000)

#define TIM2_BASE                               (PB1PERIPH_BASE + 0x0000)
#define TIM3_BASE                               (PB1PERIPH_BASE + 0x0400)
#define TIM4_BASE                               (PB1PERIPH_BASE + 0x0800)
#define RTC_BASE                                (PB1PERIPH_BASE + 0x2800)
#define WWDG_BASE                               (PB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE                               (PB1PERIPH_BASE + 0x3000)
#define SPI2_BASE                               (PB1PERIPH_BASE + 0x3800)
#define USART2_BASE                             (PB1PERIPH_BASE + 0x4400)
#define USART3_BASE                             (PB1PERIPH_BASE + 0x4800)
#define USART4_BASE                             (PB1PERIPH_BASE + 0x4C00)
#define I2C1_BASE                               (PB1PERIPH_BASE + 0x5400)
#define I2C2_BASE                               (PB1PERIPH_BASE + 0x5800)
#define CAN1_BASE                               (PB1PERIPH_BASE + 0x6400)
#define BKP_BASE                                (PB1PERIPH_BASE + 0x6C00)
#define PWR_BASE                                (PB1PERIPH_BASE + 0x7000)
#define LPTIM_BASE                              (PB1PERIPH_BASE + 0x7C00)

#define AFIO_BASE                               (PB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (PB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (PB2PERIPH_BASE + 0x0800)
#define GPIOB_BASE                              (PB2PERIPH_BASE + 0x0C00)
#define GPIOC_BASE                              (PB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                              (PB2PERIPH_BASE + 0x1400)
#define ADC1_BASE                               (PB2PERIPH_BASE + 0x2400)
#define TIM1_BASE                               (PB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (PB2PERIPH_BASE + 0x3000)
#define USART1_BASE                             (PB2PERIPH_BASE + 0x3800)

#define DMA1_BASE                               (HBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (HBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (HBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (HBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (HBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (HBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (HBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (HBPERIPH_BASE + 0x0080)
#define DMA1_Channel8_BASE                      (HBPERIPH_BASE + 0x0094)
#define RCC_BASE                                (HBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE                            (HBPERIPH_BASE + 0x2000)
#define CRC_BASE                                (HBPERIPH_BASE + 0x3000)
#define EXTEN_BASE                              (HBPERIPH_BASE + 0x3800)
#define OPA_BASE                                (HBPERIPH_BASE + 0x6000)
#define USBPD_BASE                              (HBPERIPH_BASE + 0x7000)

#define USBFS_BASE                              ((uint32_t)0x50000000)

#define OB_BASE                                 ((uint32_t)0x1FFFF800)

#define TS_BASE                                 ((uint32_t)0x1FFFF720)
#define OPA_TRIM_BASE                           ((uint32_t)0x1FFFF724)
#define ADC_TRIM_BASE                           ((uint32_t)0x1FFFF728)
#define HSI_LP_TRIM_BASE                        ((uint32_t)0x1FFFF72A)
#define CHIPID_BASE                             ((uint32_t)0x1FFFF704)
#define USBPD_CFG_BASE                          ((uint32_t)0x1FFFF730)

