openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103.h
#define CAN_ERRSR_TEC                           ((uint32_t)0x00FF0000) /* Least significant byte of the 9-bit Transmit Error Counter */
#define CAN_ERRSR_REC                           ((uint32_t)0xFF000000) /* Receive Error Counter */

/*******************  Bit definition for CAN_BTIMR register  ********************/
#define CAN_BTIMR_BRP                           ((uint32_t)0x000003FF) /* Baud Rate Prescaler */
#define CAN_BTIMR_TS1                           ((uint32_t)0x000F0000) /* Time Segment 1 */
#define CAN_BTIMR_TS2                           ((uint32_t)0x00700000) /* Time Segment 2 */
#define CAN_BTIMR_SJW                           ((uint32_t)0x03000000) /* Resynchronization Jump Width */
#define CAN_BTIMR_LBKM                          ((uint32_t)0x40000000) /* Loop Back Mode (Debug) */
#define CAN_BTIMR_SILM                          ((uint32_t)0x80000000) /* Silent Mode */

/********************  Bit definition for CAN_TTCTLR register  *******************/
#define CAN_TTCTLR_TIMCMV                       ((uint32_t)0x0000FFFF)
#define CAN_TTCTLR_TIMRST                       ((uint32_t)0x00010000)
#define CAN_TTCTLR_MODE                         ((uint32_t)0x00020000)

/********************  Bit definition for CAN_TTCNT register  *******************/
#define CAN_TTCNT                               ((uint32_t)0x0000FFFF)

/********************  Bit definition for CAN_TERR_CNT register  *******************/
#define CAN_TERR_CNT                            ((uint32_t)0x000001FF)

/********************  Bit definition for CANFD_CR register  *******************/
#define CANFD_CR_TX_FD                          ((uint32_t)0x00000001)
#define CANFD_CR_TX_BRS_B                       ((uint32_t)0x0000000E)
#define CANFD_CR_USER_ESI_B                     ((uint32_t)0x00000070)
#define CANFD_CR_RES_EXCEPT                     ((uint32_t)0x00000080)
#define CANFD_CR_CLAS_LONG_TS1                  ((uint32_t)0x00000100)
#define CANFD_CR_RESTRICT_MODE                  ((uint32_t)0x00000200)

/********************  Bit definition for CANFD_BTR register  *******************/
#define CANFD_BTR_BTR_SJW_FD                    ((uint32_t)0x0000000F)
#define CANFD_BTR_BTR_TS2_FD                    ((uint32_t)0x000000F0)
#define CANFD_BTR_BTR_TS1_FD                    ((uint32_t)0x00001F00)
#define CANFD_BTR_BTR_BRP_FD                    ((uint32_t)0x001F0000)
#define CANFD_BTR_BTR_TDCE                      ((uint32_t)0x00800000)

/********************  Bit definition for CANFD_TDCT register  *******************/
#define CANFD_TDCT_TDCO                         ((uint32_t)0x0000003F)
#define CANFD_TDCT_TDC_FILTER                   ((uint32_t)0x00003F00)

/********************  Bit definition for CANFD_PSR register  *******************/
#define CANFD_PSR_TDCV                          ((uint32_t)0x00FF0000)

/********************  Bit definition for CAN_DMA_T0 register  *******************/
#define CANFD_DMA_T0                            ((uint32_t)0x00007FFF)

/********************  Bit definition for CAN_DMA_T1 register  *******************/
#define CANFD_DMA_T1                            ((uint32_t)0x00007FFF)

/********************  Bit definition for CAN_DMA_T2 register  *******************/
#define CANFD_DMA_T2                            ((uint32_t)0x00007FFF)

/********************  Bit definition for CAN_DMA_R0 register  *******************/
#define CANFD_DMA_R0                            ((uint32_t)0x00007FFF)

/********************  Bit definition for CAN_DMA_R1 register  *******************/
#define CANFD_DMA_R1                            ((uint32_t)0x00007FFF)

/******************  Bit definition for CAN_TXMI0R register  ********************/
#define CAN_TXMI0R_TXRQ                         ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TXMI0R_RTR                          ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TXMI0R_IDE                          ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TXMI0R_EXID                         ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_TXMI0R_STID                         ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/******************  Bit definition for CAN_TXMDT0R register  *******************/
#define CAN_TXMDT0R_DLC                         ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TXMDT0R_TGT                         ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TXMDT0R_TIME                        ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/******************  Bit definition for CAN_TXMDL0R register  *******************/
#define CAN_TXMDL0R_DATA0                       ((uint32_t)0x000000FF) /* Data byte 0 */
#define CAN_TXMDL0R_DATA1                       ((uint32_t)0x0000FF00) /* Data byte 1 */
#define CAN_TXMDL0R_DATA2                       ((uint32_t)0x00FF0000) /* Data byte 2 */
#define CAN_TXMDL0R_DATA3                       ((uint32_t)0xFF000000) /* Data byte 3 */

/******************  Bit definition for CAN_TXMDH0R register  *******************/
#define CAN_TXMDH0R_DATA4                       ((uint32_t)0x000000FF) /* Data byte 4 */
#define CAN_TXMDH0R_DATA5                       ((uint32_t)0x0000FF00) /* Data byte 5 */
#define CAN_TXMDH0R_DATA6                       ((uint32_t)0x00FF0000) /* Data byte 6 */
#define CAN_TXMDH0R_DATA7                       ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_TXMI1R register  *******************/
#define CAN_TXMI1R_TXRQ                         ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define CAN_TXMI1R_RTR                          ((uint32_t)0x00000002) /* Remote Transmission Request */
#define CAN_TXMI1R_IDE                          ((uint32_t)0x00000004) /* Identifier Extension */
#define CAN_TXMI1R_EXID                         ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define CAN_TXMI1R_STID                         ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT1R register  ******************/
#define CAN_TXMDT1R_DLC                         ((uint32_t)0x0000000F) /* Data Length Code */
#define CAN_TXMDT1R_TGT                         ((uint32_t)0x00000100) /* Transmit Global Time */
#define CAN_TXMDT1R_TIME                        ((uint32_t)0xFFFF0000) /* Message Time Stamp */

