openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103.h
/*******************  Bit definition for WWDG_CTLR register  ********************/
#define WWDG_CTLR_T                             ((uint8_t)0x7F) /* T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CTLR_T0                            ((uint8_t)0x01) /* Bit 0 */
#define WWDG_CTLR_T1                            ((uint8_t)0x02) /* Bit 1 */
#define WWDG_CTLR_T2                            ((uint8_t)0x04) /* Bit 2 */
#define WWDG_CTLR_T3                            ((uint8_t)0x08) /* Bit 3 */
#define WWDG_CTLR_T4                            ((uint8_t)0x10) /* Bit 4 */
#define WWDG_CTLR_T5                            ((uint8_t)0x20) /* Bit 5 */
#define WWDG_CTLR_T6                            ((uint8_t)0x40) /* Bit 6 */

#define WWDG_CTLR_WDGA                          ((uint8_t)0x80) /* Activation bit */

/*******************  Bit definition for WWDG_CFGR register  *******************/
#define WWDG_CFGR_W                             ((uint16_t)0x007F) /* W[6:0] bits (7-bit window value) */
#define WWDG_CFGR_W0                            ((uint16_t)0x0001) /* Bit 0 */
#define WWDG_CFGR_W1                            ((uint16_t)0x0002) /* Bit 1 */
#define WWDG_CFGR_W2                            ((uint16_t)0x0004) /* Bit 2 */
#define WWDG_CFGR_W3                            ((uint16_t)0x0008) /* Bit 3 */
#define WWDG_CFGR_W4                            ((uint16_t)0x0010) /* Bit 4 */
#define WWDG_CFGR_W5                            ((uint16_t)0x0020) /* Bit 5 */
#define WWDG_CFGR_W6                            ((uint16_t)0x0040) /* Bit 6 */

#define WWDG_CFGR_WDGTB                         ((uint16_t)0x0180) /* WDGTB[1:0] bits (Timer Base) */
#define WWDG_CFGR_WDGTB0                        ((uint16_t)0x0080) /* Bit 0 */
#define WWDG_CFGR_WDGTB1                        ((uint16_t)0x0100) /* Bit 1 */

#define WWDG_CFGR_EWI                           ((uint16_t)0x0200) /* Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STATR register  ********************/
#define WWDG_STATR_EWIF                         ((uint8_t)0x01) /* Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                          ENHANCED FUNNCTION                                */
/******************************************************************************/

/****************************  Enhanced register  *****************************/
#define EXTEN_PLL_HSI_PRE                       ((uint32_t)0x00000010) /* Bit 4 */
#define EXTEN_LOCKUP_EN                         ((uint32_t)0x00000040) /* Bit 5 */
#define EXTEN_LOCKUP_RSTF                       ((uint32_t)0x00000080) /* Bit 7 */

#define EXTEN_ULLDO_TRIM                        ((uint32_t)0x00000700) /* ULLDO_TRIM[2:0] bits */
#define EXTEN_ULLDO_TRIM0                       ((uint32_t)0x00000100) /* Bit 0 */
#define EXTEN_ULLDO_TRIM1                       ((uint32_t)0x00000200) /* Bit 1 */
#define EXTEN_ULLDO_TRIM2                       ((uint32_t)0x00000400) /* Bit 2 */

#define EXTEN_LDO_TRIM                          ((uint32_t)0x00003000) /* LDO_TRIM[1:0] bits */
#define EXTEN_LDO_TRIM0                         ((uint32_t)0x00001000) /* Bit 0 */
#define EXTEN_LDO_TRIM1                         ((uint32_t)0x00002000) /* Bit 1 */

/******************************************************************************/
/*                               DEBUG SUPPORT                                */
/******************************************************************************/
/*******************  Bit definition for DBGMCU_DR register  *******************/
#define DBG_DEBUGMCU_SLEEP                      ((uint32_t)0x00000001)
#define DBG_DEBUGMCU_STOP                       ((uint32_t)0x00000002)
#define DBG_DEBUGMCU_STBY                       ((uint32_t)0x00000004)
#define DBG_DEBUGMCU_IWDG_STOP                  ((uint32_t)0x00000100)
#define DBG_DEBUGMCU_WWDG_STOP                  ((uint32_t)0x00000200)
#define DBG_DEBUGMCU_I2C1SMBUS_TOUT             ((uint32_t)0x00000400)
#define DBG_DEBUGMCU_I2C2SMBUS_TOUT             ((uint32_t)0x00000800)
#define DBG_DEBUGMCU_TIM1_STOP                  ((uint32_t)0x00001000)
#define DBG_DEBUGMCU_TIM2_STOP                  ((uint32_t)0x00002000)
#define DBG_DEBUGMCU_TIM3_STOP                  ((uint32_t)0x00004000)
#define DBG_DEBUGMCU_TIM4_STOP                  ((uint32_t)0x00008000)
#define DBG_DEBUGMCU_CAN_STOP                   ((uint32_t)0x00010000)

/******************************************************************************/
/*                              OPTICAL PARAMETER                             */
/******************************************************************************/

/*******************  Bit definition for OPA_CFGR1 register  *******************/
#define OPA_CFGR1_POLLEN                        ((uint32_t)0x00000001)
#define OPA_CFGR1_BKINEN                        ((uint32_t)0x00000004)
#define OPA_CFGR1_RSTEN                         ((uint32_t)0x00000010)
#define OPA_CFGR1_OPCMLOCK                      ((uint32_t)0x00000080)
#define OPA_CFGR1_IEOUT                         ((uint32_t)0x00000100)
#define OPA_CFGR1_IECNT                         ((uint32_t)0x00000400)
#define OPA_CFGR1_NMIEN                         ((uint32_t)0x00000800)
#define OPA_CFGR1_IFOUT                         ((uint32_t)0x00001000)
#define OPA_CFGR1_IFCNT                         ((uint32_t)0x00004000)

/*******************  Bit definition for OPA_CFGR2 register  *******************/
#define OPA_CFGR2_POLL_VLU                      ((uint32_t)0x000001FF)
#define OPA_CFGR2_POLL_NUM                      ((uint32_t)0x00000E00)
#define OPA_CFGR2_POLL_CNT                      ((uint32_t)0x00007000)

/*******************  Bit definition for OPA_CTLR1 register  *******************/
#define OPA_CTLR1_EN1                           ((uint32_t)0x00000001)
#define OPA_CTLR1_MODE1                         ((uint32_t)0x0000000E)
#define OPA_CTLR1_PSEL1                         ((uint32_t)0x00000070)
#define OPA_CTLR1_FBEN1                         ((uint32_t)0x00000080)
#define OPA_CTLR1_NSEL1                         ((uint32_t)0x00000F00)
#define OPA_CTLR1_LP1                           ((uint32_t)0x00001000)
#define OPA_CTLR1_INTRIMP                       ((uint32_t)0x00010000)
#define OPA_CTLR1_ITRIMP                        ((uint32_t)0x003E0000)
#define OPA_CTLR1_INTRIMN                       ((uint32_t)0x01000000)
#define OPA_CTLR1_ITRIMN                        ((uint32_t)0x3E000000)

/*******************  Bit definition for OPA_CTLR2 register  *******************/
#define OPA_CTLR2_EN1                           ((uint32_t)0x00000001)
#define OPA_CTLR2_MODE1                         ((uint32_t)0x00000006)
#define OPA_CTLR2_NSEL1                         ((uint32_t)0x00000008)
#define OPA_CTLR2_PSEL1                         ((uint32_t)0x00000010)
#define OPA_CTLR2_HYEN1                         ((uint32_t)0x00000020)
#define OPA_CTLR2_LP1                           ((uint32_t)0x00000040)
#define OPA_CTLR2_EN2                           ((uint32_t)0x00000100)
#define OPA_CTLR2_MODE2                         ((uint32_t)0x00000600)
#define OPA_CTLR2_NSEL2                         ((uint32_t)0x00000800)
#define OPA_CTLR2_PSEL2                         ((uint32_t)0x00001000)
#define OPA_CTLR2_HYEN2                         ((uint32_t)0x00002000)
#define OPA_CTLR2_LP2                           ((uint32_t)0x00004000)
#define OPA_CTLR2_EN3                           ((uint32_t)0x00010000)
#define OPA_CTLR2_MODE3                         ((uint32_t)0x00060000)
#define OPA_CTLR2_NSEL3                         ((uint32_t)0x00080000)
#define OPA_CTLR2_PSEL3                         ((uint32_t)0x00100000)
#define OPA_CTLR2_HYEN3                         ((uint32_t)0x00200000)
#define OPA_CTLR2_LP3                           ((uint32_t)0x00400000)

#define OPA_CTLR2_WKUP_MD                       ((uint32_t)0x03000000)
#define OPA_CTLR2_WKUP_MD_0                     ((uint32_t)0x01000000)
#define OPA_CTLR2_WKUP_MD_1                     ((uint32_t)0x02000000)

/*******************  Bit definition for OPCMKEY register  *******************/
#define OPCM_KEY                                ((uint32_t)0xFFFFFFFF)

/******************************************************************************/
/*                              LOW POWER TIM                                 */
/******************************************************************************/
/*******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_CMPM                          ((uint32_t)0x00000001)
#define LPTIM_ISR_ARRM                          ((uint32_t)0x00000002)
#define LPTIM_ISR_EXTTRIG                       ((uint32_t)0x00000004)
#define LPTIM_ISR_CMPOK                         ((uint32_t)0x00000008)
#define LPTIM_ISR_ARROK                         ((uint32_t)0000000010)
#define LPTIM_ISR_UP                            ((uint32_t)0x00000020)
#define LPTIM_ISR_DOWN                          ((uint32_t)0x00000040)
#define LPTIM_ISR_DIRSYNC                       ((uint32_t)0x00000080)

