openwch/arduino_core_ch32/system/CH32L10x/SRC/Peripheral/inc/ch32l103.h
/*******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_CMPMCF                        ((uint32_t)0x00000001)
#define LPTIM_ICR_ARRMCF                        ((uint32_t)0x00000002)
#define LPTIM_ICR_EXTTRIGCF                     ((uint32_t)0x00000004)
#define LPTIM_ICR_CMPOKCF                       ((uint32_t)0x00000008)
#define LPTIM_ICR_ARROKCF                       ((uint32_t)0x00000010)
#define LPTIM_ICR_UPCF                          ((uint32_t)0x00000020)
#define LPTIM_ICR_DOWNCF                        ((uint32_t)0x00000040)

/*******************  Bit definition for LPTIM_IER register  *******************/
#define LPTIM_IER_CMPMIE                        ((uint32_t)0x00000001)
#define LPTIM_IER_ARRMIE                        ((uint32_t)0x00000002)
#define LPTIM_IER_EXTTRIGIE                     ((uint32_t)0x00000004)
#define LPTIM_IER_CMPOKIE                       ((uint32_t)0x00000008)
#define LPTIM_IER_ARROKIE                       ((uint32_t)0x00000010)
#define LPTIM_IER_UPIE                          ((uint32_t)0x00000020)
#define LPTIM_IER_DOWNIE                        ((uint32_t)0x00000040)

/*******************  Bit definition for LPTIM_CFGR register  *******************/
#define LPTIM_CFGR_CKSEL                        ((uint32_t)0x00000001)
#define LPTIM_CFGR_CKPOL                        ((uint32_t)0x00000006)
#define LPTIM_CFGR_CKFLT                        ((uint32_t)0x00000018)
#define LPTIM_CFGR_TRGFLT                       ((uint32_t)0x000000C0)
#define LPTIM_CFGR_PRESC                        ((uint32_t)0x00000E00)
#define LPTIM_CFGR_TRIGSEL                      ((uint32_t)0x00006000)
#define LPTIM_CFGR_TRIGEN                       ((uint32_t)0x00060000)
#define LPTIM_CFGR_TIMOUT                       ((uint32_t)0x00080000)
#define LPTIM_CFGR_WAVE                         ((uint32_t)0x00100000)
#define LPTIM_CFGR_WAVPOL                       ((uint32_t)0x00200000)
#define LPTIM_CFGR_PRELOAD                      ((uint32_t)0x00400000)
#define LPTIM_CFGR_CONTMODE                     ((uint32_t)0x00800000)
#define LPTIM_CFGR_ENC                          ((uint32_t)0x01000000)
#define LPTIM_CFGR_CLKSEL                       ((uint32_t)0x06000000)
#define LPTIM_CFGR_FORCEPWM                     ((uint32_t)0x08000000)

/*******************  Bit definition for LPTIM_CR register  *******************/
#define LPTIM_CR_ENABLE                         ((uint32_t)0x00000001)
#define LPTIM_CR_SNGSTRT                        ((uint32_t)0x00000002)
#define LPTIM_CR_CNTSTRT                        ((uint32_t)0x00000004)
#define LPTIM_CR_OUTEN                          ((uint32_t)0x00000008)
#define LPTIM_CR_DIR_EXTEN                      ((uint32_t)0x00000010)

/*******************  Bit definition for LPTIM_CMP register  *******************/
#define LPTIM_CMP                               ((uint32_t)0x0000FFFF)

/*******************  Bit definition for LPTIM_ARR register  *******************/
#define LPTIM_ARR                               ((uint32_t)0x0000FFFF)

/*******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_COUNT                             ((uint32_t)0x0000FFFF)

/******************************************************************************/
/*                              TOUCH KEY                                     */
/******************************************************************************/
/*******************  Bit definition for TKEY_CHARGE register  *******************/
#define TKEY_CHGOFFSET                          ((uint32_t)0x000003FF)

/*******************  Bit definition for TKEY_ACT_DCG register  *******************/
#define TKEY_TKACTDCG                           ((uint32_t)0x000003FF)

/*******************  Bit definition for TKEY_DR register  *******************/
#define TKEY_DR                                 ((uint32_t)0x0000FFFF)

#include "ch32l103_conf.h"

#ifdef __cplusplus
}
#endif

#endif

